MaiLangYang/mcu_project_template/firmware/cmsis/GD/GD32A7xx/Source/IAR/startup_gd32a711x_a712x.s
        PUBWEAK HardFault_Handler
        SECTION .text:CODE:NOROOT:REORDER(1)
HardFault_Handler
        B HardFault_Handler

        PUBWEAK MemManage_Handler
        SECTION .text:CODE:NOROOT:REORDER(1)
MemManage_Handler
        B MemManage_Handler

        PUBWEAK BusFault_Handler
        SECTION .text:CODE:NOROOT:REORDER(1)
BusFault_Handler
        B BusFault_Handler

        PUBWEAK UsageFault_Handler
        SECTION .text:CODE:NOROOT:REORDER(1)
UsageFault_Handler
        B UsageFault_Handler

        PUBWEAK SVC_Handler
        SECTION .text:CODE:NOROOT:REORDER(1)
SVC_Handler
        B SVC_Handler

        PUBWEAK DebugMon_Handler
        SECTION .text:CODE:NOROOT:REORDER(1)
DebugMon_Handler
        B DebugMon_Handler

        PUBWEAK PendSV_Handler
        SECTION .text:CODE:NOROOT:REORDER(1)
PendSV_Handler
        B PendSV_Handler

        PUBWEAK SysTick_Handler
        SECTION .text:CODE:NOROOT:REORDER(1)
SysTick_Handler
        B SysTick_Handler

        PUBWEAK WWDGT0_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
WWDGT0_IRQHandler
        B WWDGT0_IRQHandler

        PUBWEAK HVD_LVD_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
HVD_LVD_IRQHandler
        B HVD_LVD_IRQHandler

        PUBWEAK RTC_Alarm_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
RTC_Alarm_IRQHandler
        B RTC_Alarm_IRQHandler

        PUBWEAK RTC_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
RTC_IRQHandler
        B RTC_IRQHandler

        PUBWEAK FMC_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
FMC_IRQHandler
        B FMC_IRQHandler

        PUBWEAK RCU_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
RCU_IRQHandler
        B RCU_IRQHandler

        PUBWEAK EXTI0_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
EXTI0_IRQHandler
        B EXTI0_IRQHandler

        PUBWEAK EXTI1_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
EXTI1_IRQHandler
        B EXTI1_IRQHandler

        PUBWEAK EXTI2_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
EXTI2_IRQHandler
        B EXTI2_IRQHandler

        PUBWEAK EXTI3_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
EXTI3_IRQHandler
        B EXTI3_IRQHandler

        PUBWEAK EXTI4_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
EXTI4_IRQHandler
        B EXTI4_IRQHandler

        PUBWEAK DMA0_Channel0_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
DMA0_Channel0_IRQHandler
        B DMA0_Channel0_IRQHandler

        PUBWEAK DMA0_Channel1_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
DMA0_Channel1_IRQHandler
        B DMA0_Channel1_IRQHandler

        PUBWEAK DMA0_Channel2_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
DMA0_Channel2_IRQHandler
        B DMA0_Channel2_IRQHandler

        PUBWEAK DMA0_Channel3_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
DMA0_Channel3_IRQHandler
        B DMA0_Channel3_IRQHandler

        PUBWEAK DMA0_Channel4_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
DMA0_Channel4_IRQHandler
        B DMA0_Channel4_IRQHandler

        PUBWEAK DMA0_Channel5_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
DMA0_Channel5_IRQHandler
        B DMA0_Channel5_IRQHandler

        PUBWEAK DMA0_Channel6_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
DMA0_Channel6_IRQHandler
        B DMA0_Channel6_IRQHandler

        PUBWEAK ADC0_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
ADC0_IRQHandler
        B ADC0_IRQHandler

        PUBWEAK DTM_CAN0_INT0_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
DTM_CAN0_INT0_IRQHandler
        B DTM_CAN0_INT0_IRQHandler

        PUBWEAK DTM_CAN0_INT1_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
DTM_CAN0_INT1_IRQHandler
        B DTM_CAN0_INT1_IRQHandler

        PUBWEAK DTM_CAN0_DMU_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
DTM_CAN0_DMU_IRQHandler
        B DTM_CAN0_DMU_IRQHandler

        PUBWEAK TIMER0_BRK_UP_TRG_CMT_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER0_BRK_UP_TRG_CMT_IRQHandler
        B TIMER0_BRK_UP_TRG_CMT_IRQHandler

        PUBWEAK TIMER2_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER2_IRQHandler
        B TIMER2_IRQHandler

        PUBWEAK TIMER1_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER1_IRQHandler
        B TIMER1_IRQHandler

        PUBWEAK TIMER19_BRK_UP_TRG_CMT_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER19_BRK_UP_TRG_CMT_IRQHandler
        B TIMER19_BRK_UP_TRG_CMT_IRQHandler

        PUBWEAK JDC_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
JDC_IRQHandler
        B JDC_IRQHandler

        PUBWEAK I2C0_EV_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
I2C0_EV_IRQHandler
        B I2C0_EV_IRQHandler

        PUBWEAK I2C0_ER_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
I2C0_ER_IRQHandler
        B I2C0_ER_IRQHandler

        PUBWEAK I2C1_EV_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
I2C1_EV_IRQHandler
        B I2C1_EV_IRQHandler

        PUBWEAK I2C1_ER_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
I2C1_ER_IRQHandler
        B I2C1_ER_IRQHandler

        PUBWEAK SPI0_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
SPI0_IRQHandler
        B SPI0_IRQHandler

        PUBWEAK SPI1_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
SPI1_IRQHandler
        B SPI1_IRQHandler

        PUBWEAK EXTI10_15_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
EXTI10_15_IRQHandler
        B EXTI10_15_IRQHandler

        PUBWEAK EXTI5_9_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
EXTI5_9_IRQHandler
        B EXTI5_9_IRQHandler

        PUBWEAK TAMPER_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TAMPER_IRQHandler
        B TAMPER_IRQHandler

        PUBWEAK TIMER20_BRK_UP_TRG_CMT_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER20_BRK_UP_TRG_CMT_IRQHandler
        B TIMER20_BRK_UP_TRG_CMT_IRQHandler

        PUBWEAK EXTI42_101_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
EXTI42_101_IRQHandler
        B EXTI42_101_IRQHandler

        PUBWEAK TIMER7_BRK_UP_TRG_CMT_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER7_BRK_UP_TRG_CMT_IRQHandler
        B TIMER7_BRK_UP_TRG_CMT_IRQHandler
                
        PUBWEAK PLL_LOL_DES_RESET_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
PLL_LOL_DES_RESET_IRQHandler
        B PLL_LOL_DES_RESET_IRQHandler
        
        PUBWEAK DMAMUX_OVR_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
DMAMUX_OVR_IRQHandler
        B DMAMUX_OVR_IRQHandler

        PUBWEAK FPU_WAB_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
FPU_WAB_IRQHandler
        B FPU_WAB_IRQHandler

        PUBWEAK CMP0_EXTI_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
CMP0_EXTI_IRQHandler
        B CMP0_EXTI_IRQHandler

        PUBWEAK CMP1_EXTI_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
CMP1_EXTI_IRQHandler
        B CMP1_EXTI_IRQHandler

        PUBWEAK FMU_INIT_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
FMU_INIT_IRQHandler
        B FMU_INIT_IRQHandler

