MaiLangYang/mcu_project_template/firmware/cmsis/GD/GD32A7xx/Source/IAR/startup_gd32a711x_a712x.s
        PUBWEAK ADC1_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
ADC1_IRQHandler
        B ADC1_IRQHandler

        PUBWEAK DAC0_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
DAC0_IRQHandler
        B DAC0_IRQHandler

        PUBWEAK STCM_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
STCM_IRQHandler
        B STCM_IRQHandler

        PUBWEAK DMA1_Channel0_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
DMA1_Channel0_IRQHandler
        B DMA1_Channel0_IRQHandler

        PUBWEAK DMA1_Channel1_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
DMA1_Channel1_IRQHandler
        B DMA1_Channel1_IRQHandler

        PUBWEAK DMA1_Channel2_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
DMA1_Channel2_IRQHandler
        B DMA1_Channel2_IRQHandler

        PUBWEAK DMA1_Channel3_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
DMA1_Channel3_IRQHandler
        B DMA1_Channel3_IRQHandler

        PUBWEAK DMA1_Channel4_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
DMA1_Channel4_IRQHandler
        B DMA1_Channel4_IRQHandler

        PUBWEAK DTM_CAN1_INT0_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
DTM_CAN1_INT0_IRQHandler
        B DTM_CAN1_INT0_IRQHandler

        PUBWEAK DTM_CAN1_INT1_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
DTM_CAN1_INT1_IRQHandler
        B DTM_CAN1_INT1_IRQHandler

        PUBWEAK DTM_CAN1_DMU_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
DTM_CAN1_DMU_IRQHandler
        B DTM_CAN1_DMU_IRQHandler

        PUBWEAK CTI0_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
CTI0_IRQHandler
        B CTI0_IRQHandler

        PUBWEAK CTI1_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
CTI1_IRQHandler
        B CTI1_IRQHandler

        PUBWEAK CAN0_ECCERR_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
CAN0_ECCERR_IRQHandler
        B CAN0_ECCERR_IRQHandler

        PUBWEAK CAN1_ECCERR_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
CAN1_ECCERR_IRQHandler
        B CAN1_ECCERR_IRQHandler

        PUBWEAK CAN2_ECCERR_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
CAN2_ECCERR_IRQHandler
        B CAN2_ECCERR_IRQHandler

        PUBWEAK CMP0_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
CMP0_IRQHandler
        B CMP0_IRQHandler

        PUBWEAK CMP1_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
CMP1_IRQHandler
        B CMP1_IRQHandler

        PUBWEAK DAC1_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
DAC1_IRQHandler
        B DAC1_IRQHandler

        PUBWEAK HSM_COM0_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
HSM_COM0_IRQHandler
        B HSM_COM0_IRQHandler

        PUBWEAK HSM_COM1_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
HSM_COM1_IRQHandler
        B HSM_COM1_IRQHandler

        PUBWEAK FMU_CAT_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
FMU_CAT_IRQHandler
        B FMU_CAT_IRQHandler

        PUBWEAK RCTL_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
RCTL_IRQHandler
        B RCTL_IRQHandler

        PUBWEAK SPI2_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
SPI2_IRQHandler
        B SPI2_IRQHandler

        PUBWEAK SPI3_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
SPI3_IRQHandler
        B SPI3_IRQHandler

        PUBWEAK SPI4_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
SPI4_IRQHandler
        B SPI4_IRQHandler

        PUBWEAK SPI5_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
SPI5_IRQHandler
        B SPI5_IRQHandler

        PUBWEAK QSPI_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
QSPI_IRQHandler
        B QSPI_IRQHandler

        PUBWEAK DTM_CAN2_DMU_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
DTM_CAN2_DMU_IRQHandler
        B DTM_CAN2_DMU_IRQHandler

        PUBWEAK DTM_CAN3_DMU_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
DTM_CAN3_DMU_IRQHandler
        B DTM_CAN3_DMU_IRQHandler

        PUBWEAK DTM_CAN4_DMU_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
DTM_CAN4_DMU_IRQHandler
        B DTM_CAN4_DMU_IRQHandler

        PUBWEAK DTM_CAN5_DMU_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
DTM_CAN5_DMU_IRQHandler
        B DTM_CAN5_DMU_IRQHandler

        PUBWEAK DTM_CAN6_DMU_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
DTM_CAN6_DMU_IRQHandler
        B DTM_CAN6_DMU_IRQHandler

        PUBWEAK DTM_CAN7_DMU_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
DTM_CAN7_DMU_IRQHandler
        B DTM_CAN7_DMU_IRQHandler

        PUBWEAK DTM_CAN2_INT0_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
DTM_CAN2_INT0_IRQHandler
        B DTM_CAN2_INT0_IRQHandler

        PUBWEAK DTM_CAN2_INT1_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
DTM_CAN2_INT1_IRQHandler
        B DTM_CAN2_INT1_IRQHandler

        PUBWEAK DTM_CAN3_INT0_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
DTM_CAN3_INT0_IRQHandler
        B DTM_CAN3_INT0_IRQHandler

        PUBWEAK DTM_CAN3_INT1_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
DTM_CAN3_INT1_IRQHandler
        B DTM_CAN3_INT1_IRQHandler

        PUBWEAK DTM_CAN4_INT0_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
DTM_CAN4_INT0_IRQHandler
        B DTM_CAN4_INT0_IRQHandler

        PUBWEAK DTM_CAN4_INT1_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
DTM_CAN4_INT1_IRQHandler
        B DTM_CAN4_INT1_IRQHandler

        PUBWEAK DTM_CAN5_INT0_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
DTM_CAN5_INT0_IRQHandler
        B DTM_CAN5_INT0_IRQHandler

        PUBWEAK DTM_CAN5_INT1_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
DTM_CAN5_INT1_IRQHandler
        B DTM_CAN5_INT1_IRQHandler

        PUBWEAK DTM_CAN6_INT0_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
DTM_CAN6_INT0_IRQHandler
        B DTM_CAN6_INT0_IRQHandler

        PUBWEAK DTM_CAN6_INT1_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
DTM_CAN6_INT1_IRQHandler
        B DTM_CAN6_INT1_IRQHandler

        PUBWEAK DTM_CAN7_INT0_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
DTM_CAN7_INT0_IRQHandler
        B DTM_CAN7_INT0_IRQHandler

        PUBWEAK DTM_CAN7_INT1_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
DTM_CAN7_INT1_IRQHandler
        B DTM_CAN7_INT1_IRQHandler

        PUBWEAK TIMER19_CC0_CC0N_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER19_CC0_CC0N_IRQHandler
        B TIMER19_CC0_CC0N_IRQHandler

        PUBWEAK TIMER19_CC1_CC1N_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER19_CC1_CC1N_IRQHandler
        B TIMER19_CC1_CC1N_IRQHandler

        PUBWEAK TIMER19_CC2_CC2N_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER19_CC2_CC2N_IRQHandler
        B TIMER19_CC2_CC2N_IRQHandler

        PUBWEAK TIMER19_CC3_CC3N_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER19_CC3_CC3N_IRQHandler
        B TIMER19_CC3_CC3N_IRQHandler

        PUBWEAK TIMER20_CC0_CC0N_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER20_CC0_CC0N_IRQHandler
        B TIMER20_CC0_CC0N_IRQHandler

        PUBWEAK TIMER20_CC1_CC1N_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER20_CC1_CC1N_IRQHandler
        B TIMER20_CC1_CC1N_IRQHandler

        PUBWEAK TIMER20_CC2_CC2N_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER20_CC2_CC2N_IRQHandler
        B TIMER20_CC2_CC2N_IRQHandler

        PUBWEAK TIMER20_CC3_CC3N_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER20_CC3_CC3N_IRQHandler
        B TIMER20_CC3_CC3N_IRQHandler

        PUBWEAK TIMER60_CC0_CC0N_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER60_CC0_CC0N_IRQHandler
        B TIMER60_CC0_CC0N_IRQHandler

        PUBWEAK TIMER60_CC1_CC1N_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER60_CC1_CC1N_IRQHandler
        B TIMER60_CC1_CC1N_IRQHandler

        PUBWEAK TIMER60_CC2_CC2N_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER60_CC2_CC2N_IRQHandler
        B TIMER60_CC2_CC2N_IRQHandler

        PUBWEAK TIMER60_CC3_CC3N_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER60_CC3_CC3N_IRQHandler
        B TIMER60_CC3_CC3N_IRQHandler

        PUBWEAK TIMER61_CC0_CC0N_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER61_CC0_CC0N_IRQHandler
        B TIMER61_CC0_CC0N_IRQHandler

        PUBWEAK TIMER61_CC1_CC1N_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER61_CC1_CC1N_IRQHandler
        B TIMER61_CC1_CC1N_IRQHandler

        PUBWEAK TIMER61_CC2_CC2N_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER61_CC2_CC2N_IRQHandler
        B TIMER61_CC2_CC2N_IRQHandler

        PUBWEAK TIMER61_CC3_CC3N_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER61_CC3_CC3N_IRQHandler
        B TIMER61_CC3_CC3N_IRQHandler

        PUBWEAK TIMER62_CC0_CC0N_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER62_CC0_CC0N_IRQHandler
        B TIMER62_CC0_CC0N_IRQHandler

