MaiLangYang/mcu_project_template/firmware/cmsis/GD/GD32A7xx/Source/IAR/startup_gd32a711x_a712x.s
        PUBWEAK TIMER62_CC1_CC1N_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER62_CC1_CC1N_IRQHandler
        B TIMER62_CC1_CC1N_IRQHandler

        PUBWEAK TIMER62_CC2_CC2N_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER62_CC2_CC2N_IRQHandler
        B TIMER62_CC2_CC2N_IRQHandler

        PUBWEAK TIMER62_CC3_CC3N_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER62_CC3_CC3N_IRQHandler
        B TIMER62_CC3_CC3N_IRQHandler

        PUBWEAK TIMER63_CC0_CC0N_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER63_CC0_CC0N_IRQHandler
        B TIMER63_CC0_CC0N_IRQHandler

        PUBWEAK TIMER63_CC1_CC1N_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER63_CC1_CC1N_IRQHandler
        B TIMER63_CC1_CC1N_IRQHandler

        PUBWEAK TIMER63_CC2_CC2N_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER63_CC2_CC2N_IRQHandler
        B TIMER63_CC2_CC2N_IRQHandler

        PUBWEAK TIMER63_CC3_CC3N_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER63_CC3_CC3N_IRQHandler
        B TIMER63_CC3_CC3N_IRQHandler

        PUBWEAK DMA0_Channel7_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
DMA0_Channel7_IRQHandler
        B DMA0_Channel7_IRQHandler

        PUBWEAK DMA1_Channel5_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
DMA1_Channel5_IRQHandler
        B DMA1_Channel5_IRQHandler

        PUBWEAK DMA1_Channel6_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
DMA1_Channel6_IRQHandler
        B DMA1_Channel6_IRQHandler

        PUBWEAK DMA1_Channel7_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
DMA1_Channel7_IRQHandler
        B DMA1_Channel7_IRQHandler

        PUBWEAK LINFlexD0_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
LINFlexD0_IRQHandler
        B LINFlexD0_IRQHandler

        PUBWEAK LINFlexD1_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
LINFlexD1_IRQHandler
        B LINFlexD1_IRQHandler

        PUBWEAK LINFlexD2_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
LINFlexD2_IRQHandler
        B LINFlexD2_IRQHandler

        PUBWEAK LINFlexD3_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
LINFlexD3_IRQHandler
        B LINFlexD3_IRQHandler

        PUBWEAK LINFlexD4_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
LINFlexD4_IRQHandler
        B LINFlexD4_IRQHandler

        PUBWEAK LINFlexD5_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
LINFlexD5_IRQHandler
        B LINFlexD5_IRQHandler

        PUBWEAK TIMER0_CC0_CC0N_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER0_CC0_CC0N_IRQHandler
        B TIMER0_CC0_CC0N_IRQHandler

        PUBWEAK TIMER0_CC1_CC1N_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER0_CC1_CC1N_IRQHandler
        B TIMER0_CC1_CC1N_IRQHandler

        PUBWEAK TIMER0_CC2_CC2N_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER0_CC2_CC2N_IRQHandler
        B TIMER0_CC2_CC2N_IRQHandler

        PUBWEAK TIMER0_CC3_CC3N_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER0_CC3_CC3N_IRQHandler
        B TIMER0_CC3_CC3N_IRQHandler

        PUBWEAK TIMER7_CC0_CC0N_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER7_CC0_CC0N_IRQHandler
        B TIMER7_CC0_CC0N_IRQHandler

        PUBWEAK TIMER7_CC1_CC1N_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER7_CC1_CC1N_IRQHandler
        B TIMER7_CC1_CC1N_IRQHandler

        PUBWEAK TIMER7_CC2_CC2N_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER7_CC2_CC2N_IRQHandler
        B TIMER7_CC2_CC2N_IRQHandler

        PUBWEAK TIMER7_CC3_CC3N_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER7_CC3_CC3N_IRQHandler
        B TIMER7_CC3_CC3N_IRQHandler

        PUBWEAK TIMER1_CC0_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER1_CC0_IRQHandler
        B TIMER1_CC0_IRQHandler

        PUBWEAK TIMER1_CC1_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER1_CC1_IRQHandler
        B TIMER1_CC1_IRQHandler

        PUBWEAK TIMER1_CC2_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER1_CC2_IRQHandler
        B TIMER1_CC2_IRQHandler

        PUBWEAK TIMER1_CC3_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER1_CC3_IRQHandler
        B TIMER1_CC3_IRQHandler

        PUBWEAK TIMER2_CC0_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER2_CC0_IRQHandler
        B TIMER2_CC0_IRQHandler

        PUBWEAK TIMER2_CC1_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER2_CC1_IRQHandler
        B TIMER2_CC1_IRQHandler

        PUBWEAK TIMER2_CC2_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER2_CC2_IRQHandler
        B TIMER2_CC2_IRQHandler

        PUBWEAK TIMER2_CC3_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER2_CC3_IRQHandler
        B TIMER2_CC3_IRQHandler

        PUBWEAK FWDGT_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
FWDGT_IRQHandler
        B FWDGT_IRQHandler

        PUBWEAK RCU_CK_FAIL_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
RCU_CK_FAIL_IRQHandler
        B RCU_CK_FAIL_IRQHandler

        PUBWEAK TIMER60_BRK_UP_TRG_CMT_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER60_BRK_UP_TRG_CMT_IRQHandler
        B TIMER60_BRK_UP_TRG_CMT_IRQHandler

        PUBWEAK TIMER61_BRK_UP_TRG_CMT_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER61_BRK_UP_TRG_CMT_IRQHandler
        B TIMER61_BRK_UP_TRG_CMT_IRQHandler

        PUBWEAK TIMER62_BRK_UP_TRG_CMT_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER62_BRK_UP_TRG_CMT_IRQHandler
        B TIMER62_BRK_UP_TRG_CMT_IRQHandler

        PUBWEAK TIMER63_BRK_UP_TRG_CMT_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER63_BRK_UP_TRG_CMT_IRQHandler
        B TIMER63_BRK_UP_TRG_CMT_IRQHandler

        PUBWEAK TIMER5_CH0_UP_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER5_CH0_UP_IRQHandler
        B TIMER5_CH0_UP_IRQHandler

        PUBWEAK TIMER5_CH1_UP_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER5_CH1_UP_IRQHandler
        B TIMER5_CH1_UP_IRQHandler

        PUBWEAK TIMER5_CH2_UP_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER5_CH2_UP_IRQHandler
        B TIMER5_CH2_UP_IRQHandler

        PUBWEAK TIMER5_CH3_UP_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER5_CH3_UP_IRQHandler
        B TIMER5_CH3_UP_IRQHandler

        PUBWEAK TIMER6_CH0_UP_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER6_CH0_UP_IRQHandler
        B TIMER6_CH0_UP_IRQHandler

        PUBWEAK TIMER6_CH1_UP_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER6_CH1_UP_IRQHandler
        B TIMER6_CH1_UP_IRQHandler

        PUBWEAK TIMER6_CH2_UP_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER6_CH2_UP_IRQHandler
        B TIMER6_CH2_UP_IRQHandler

        PUBWEAK TIMER6_CH3_UP_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER6_CH3_UP_IRQHandler
        B TIMER6_CH3_UP_IRQHandler

        END
